Flamecthulhu/AI_Wallet_Grade3/Basic/STM32/STM32_Final/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BT_TX_Pin GPIO_PIN_0
#define BT_TX_GPIO_Port GPIOA
#define BT_RX_Pin GPIO_PIN_1
#define BT_RX_GPIO_Port GPIOA
#define EPD_SCK_Pin GPIO_PIN_5
#define EPD_SCK_GPIO_Port GPIOA
#define EPD_MOSI_Pin GPIO_PIN_7
#define EPD_MOSI_GPIO_Port GPIOA
#define GPS_RX_Pin GPIO_PIN_7
#define GPS_RX_GPIO_Port GPIOE
#define GPS_TX_Pin GPIO_PIN_8
#define GPS_TX_GPIO_Port GPIOE
#define WF_RX_Pin GPIO_PIN_12
#define WF_RX_GPIO_Port GPIOB
#define WF_TX_Pin GPIO_PIN_13
#define WF_TX_GPIO_Port GPIOB
#define STA_LED_Pin GPIO_PIN_8
#define STA_LED_GPIO_Port GPIOD
#define WF_LED_Pin GPIO_PIN_9
#define WF_LED_GPIO_Port GPIOD
#define BT_RLED_Pin GPIO_PIN_10
#define BT_RLED_GPIO_Port GPIOD
#define BT_BLED_Pin GPIO_PIN_11
#define BT_BLED_GPIO_Port GPIOD
#define EC_RELAY_Pin GPIO_PIN_12
#define EC_RELAY_GPIO_Port GPIOD
#define EC_LED_Pin GPIO_PIN_13
#define EC_LED_GPIO_Port GPIOD
#define EPD_RST_Pin GPIO_PIN_14
#define EPD_RST_GPIO_Port GPIOD
#define EPD_DC_Pin GPIO_PIN_15
#define EPD_DC_GPIO_Port GPIOD
#define EPD_CS_Pin GPIO_PIN_6
#define EPD_CS_GPIO_Port GPIOC
#define EPD_BUSY_Pin GPIO_PIN_7
#define EPD_BUSY_GPIO_Port GPIOC
#define GPS_GLED_Pin GPIO_PIN_12
#define GPS_GLED_GPIO_Port GPIOA
#define GPS_RLED_Pin GPIO_PIN_13
#define GPS_RLED_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
